ua1arn/hftrx/boards/arm_stm32f4xx_tqfp176_ctlstyle_storch_v6_UA1M.h
/* $Id: arm_stm32f4xx_tqfp176_ctlstyle_storch_v6_UA1M.h 6875 2018-12-06 15:07:59Z gena $ */
/* board-specific CPU attached signals */
//
// РџСЂРѕРµРєС‚ HF Dream Receiver (РљР’ РїСЂРёС‘РјРЅРёРє РјРµС‡С‚С‹)
// Р°РІС‚РѕСЂ Р“РµРЅР° Р—Р°РІРёРґРѕРІСЃРєРёР№ mgs2001@mail.ru
// UA1ARN
//
// РўСЂР°РЅСЃРёРІРµСЂ СЃ DSP РѕР±СЂР°Р±РѕС‚РєРѕР№ "РђРёСЃС‚" РЅР° РїСЂРѕС†РµСЃСЃРѕСЂРµ 
// Rmainunit_v5la.pcb STM32H743IIT6, TFT 4.3", 2xmini-USB, mini SD-CARD, NAU8822L Рё FPGA EP4CE22E22I7N

#ifndef ARM_STM32F4XX_TQFP176_CTLSTYLE_STORCH_V6_H_INCLUDED
#define ARM_STM32F4XX_TQFP176_CTLSTYLE_STORCH_V6_H_INCLUDED 1

	#if ! defined(STM32H743xx)
		#error Wrong CPU selected. STM32H743xx expected
	#endif /* ! defined(STM32F767xx) */

	//#define WITHSAICLOCKFROMI2S 1	/* Р‘Р»РѕРє SAI1 С‚Р°РєС‚РёСЂСѓРµС‚СЃСЏ РѕС‚ PLL I2S */
	#define WITHI2SCLOCKFROMPIN 1	// С‚Р°РєС‚РѕРІР°СЏ С‡Р°СЃС‚РѕС‚Р° РЅР° SPI2 (I2S) РїРѕРґР°РµС‚СЃСЏ СЃ РІРЅРµС€РЅРµРіРѕ РіРµРЅРµСЂР°С‚РѕСЂР°, РІ РїСЂРѕС†РµСЃСЃРѕСЂ РІРІРѕРґРёС‚СЃСЏ С‡РµСЂРµР· MCK СЃРёРіРЅР°Р» РёРЅС‚РµСЂС„РµР№СЃР°
	#define WITHSAICLOCKFROMPIN 1	// С‚Р°РєС‚РѕРІР°СЏ С‡Р°СЃС‚РѕС‚Р° РЅР° SAI1 РїРѕРґР°РµС‚СЃСЏ СЃ РІРЅРµС€РЅРµРіРѕ РіРµРЅРµСЂР°С‚РѕСЂР°, РІ РїСЂРѕС†РµСЃСЃРѕСЂ РІРІРѕРґРёС‚СЃСЏ С‡РµСЂРµР· MCK СЃРёРіРЅР°Р» РёРЅС‚РµСЂС„РµР№СЃР°

	#define WITHUSEPLL		1	/* Р“Р»Р°РІРЅР°СЏ PLL	*/
	#define WITHUSEPLL3		1	/* PLL3 - РґР»СЏ LTDC РЅР° STM32H743xx	*/
	//#define WITHUSESAIPLL	1	/* SAI PLL	*/
	//#define WITHUSESAII2S	1	/* I2S PLL	*/
	//#define LTDC_DOTCLK	9000000UL	// С‡Р°СЃС‚РѕС‚Р° РїРёРєСЃРµР»РµР№ РїСЂРё СЂР°Р±РѕС‚Рµ СЃ РёРЅС‚РµСЂС„РµР№СЃРѕРј RGB

	#if 1
		// РїСЂРё РЅР°Р»РёС‡РёРё РІРЅРµС€РЅРµРіРѕ РєРІР°СЂС†РµРІРѕРіРѕ СЂРµР·РѕРЅР°С‚РѕСЂР°
		#define WITHCPUXTAL 12000000uL	/* РќР° РїСЂРѕС†РµСЃСЃРѕСЂРµ СѓСЃС‚Р°РЅРѕРІР»РµРЅ РєРІР°СЂС† 12.000 РњР“С† */
		#define REF1_DIV 6			// ref freq = 2.0000 MHz
		#define REF3_DIV 6			// ref freq = 2.0000 MHz

		#if defined(STM32F767xx)
			// normal operation frequency
			#define REF1_MUL 216		// 2*216.000 MHz (192 <= PLLN <= 432)
			#define HARDWARE_FLASH_LATENCY FLASH_ACR_LATENCY_6WS
		#elif CPUSTYLE_STM32F7XX
			// normal operation frequency
			#define REF1_MUL 216		// 2*216.000 MHz (192 <= PLLN <= 432)
			#define HARDWARE_FLASH_LATENCY FLASH_ACR_LATENCY_7WS
		#elif CPUSTYLE_STM32H7XX
			// normal operation frequency
			#define REF1_MUL 384		// 2*384.000 MHz (192 <= PLLN <= 432)
			#define REF3_MUL 135		// 2*135.000 MHz (192 <= PLLN <= 432)
			#define HARDWARE_FLASH_LATENCY FLASH_ACR_LATENCY_2WS
		#endif

	#else

		#if defined(STM32F767xx)
			// С‚Р°РєС‚РёСЂРѕРІР°РЅРёРµ РѕС‚ РІРЅСѓС‚СЂРµРЅРЅРµРіРѕ RC РіРµРЅРµСЂР°С‚РѕСЂР° 16 РњР“С†
			#define REF1_DIV 8			// ref freq = 2.000 MHz
			// normal operation frequency
			#define REF1_MUL 216		// 2*216.000 MHz (192 <= PLLN <= 432)
			#define HARDWARE_FLASH_LATENCY FLASH_ACR_LATENCY_6WS
		#elif CPUSTYLE_STM32F7XX
			// С‚Р°РєС‚РёСЂРѕРІР°РЅРёРµ РѕС‚ РІРЅСѓС‚СЂРµРЅРЅРµРіРѕ RC РіРµРЅРµСЂР°С‚РѕСЂР° 16 РњР“С†
			#define REF1_DIV 8			// ref freq = 2.000 MHz
			// normal operation frequency
			#define REF1_MUL 216		// 2*216.000 MHz (192 <= PLLN <= 432)
			#define HARDWARE_FLASH_LATENCY FLASH_ACR_LATENCY_7WS
		#elif CPUSTYLE_STM32H7XX
			// С‚Р°РєС‚РёСЂРѕРІР°РЅРёРµ РѕС‚ РІРЅСѓС‚СЂРµРЅРЅРµРіРѕ RC РіРµРЅРµСЂР°С‚РѕСЂР° 64 РњР“С†
			#define REF1_DIV 32			// ref freq = 2.000 MHz
			#define REF3_DIV 32			// ref freq = 2.000 MHz
			// normal operation frequency
			#define REF1_MUL 384		// 2*384.000 MHz (192 <= PLLN <= 432)
			#define REF3_MUL 135		// 2*135.000 MHz (192 <= PLLN <= 432)
			#define HARDWARE_FLASH_LATENCY FLASH_ACR_LATENCY_2WS
		#endif

	#endif

	#if WITHI2SCLOCKFROMPIN
		#define FPGADECIMATION 2560
		#define FPGADIVIDERATIO 5
		#define EXTI2S_FREQ (REFERENCE_FREQ * DDS1_CLK_MUL / FPGADIVIDERATIO)
		#define EXTSAI_FREQ (REFERENCE_FREQ * DDS1_CLK_MUL / FPGADIVIDERATIO)

		#define ARMI2SMCLK	(REFERENCE_FREQ * DDS1_CLK_MUL / (FPGADECIMATION / 256))
		#define ARMSAIMCLK	(REFERENCE_FREQ * DDS1_CLK_MUL / (FPGADECIMATION / 256))
	#else /* WITHI2SCLOCKFROMPIN */
		#define PLLI2SN_MUL 172		// 344.064 (192 <= PLLI2SN <= 432)
		#define SAIREF1_MUL 172		// 245.76 / 1.024 = 240 (49 <= PLLSAIN <= 432)
		// Р§Р°СЃС‚РѕС‚Р° С„РѕСЂРјРёСЂСѓРµС‚СЃСЏ РїСЂРѕС†РµСЃСЃРѕСЂРѕРј
		#define ARMI2SMCLK	12288000 //(PLLSAI_FREQ_OUT / 14)
		#define ARMSAIMCLK	12288000 //(PLLSAI_FREQ_OUT / 14)
	#endif /* WITHI2SCLOCKFROMPIN */

	/* РјРѕРґРµР»Рё СЃРёРЅС‚РµР·Р°С‚РѕСЂРѕРІ - СЃС…РµРјС‹ С‡Р°СЃС‚РѕС‚РѕРѕР±СЂР°Р·РѕРІР°РЅРёСЏ */

	/* Р’РµСЂСЃРёРё С‡Р°СЃС‚РѕС‚РЅС‹С… СЃС…РµРј - СЃ РїСЂРµРѕР±СЂР°Р·РѕРІР°РЅРёРµРј "РЅР°РІРµСЂС…" */
	//#define FQMODEL_45_IF8868_UHF430	1	// SW2011
	//#define FQMODEL_73050		1	// 1-st IF=73.050, 2-nd IF=0.455 MHz
	//#define FQMODEL_73050_IF0P5		1	// 1-st IF=73.050, 2-nd IF=0.5 MHz
	//#define FQMODEL_80455		1	// 1-st IF=80.455, 2-nd IF=0.455 MHz
	//#define FQMODEL_64455_IF0P5		1	// 1-st IF=64.455, 2-nd IF=0.5 MHz
	//#define FQMODEL_70455		1	// 1-st IF=70.455, 2-nd IF=0.455 MHz
	//#define FQMODEL_70200		1	// 1-st if = 70.2 MHz, 2-nd IF-200 kHz
	//#define FQMODEL_60700_IF05	1	// 60.7 -> 10.7 -> 0.5
	//#define FQMODEL_60725_IF05	1	// 60.725 -> 10.725 -> 0.5
	//#define FQMODEL_60700_IF02	1	// 60.7 -> 10.7 -> 0.2
	//#define FQMODEL_70200		1	// 1-st if = 70.2 MHz, 2-nd IF-200 kHz

	// +++ РІР°СЂРёР°С†РёРё РїСЂРѕС€РёРІРєРё, СЃРїРµС†РёС„РёС‡РµСЃРєРёРµ РґР»СЏ СЂР°Р·РЅС‹С… С‡Р°СЃС‚РѕС‚ РѕРїРѕСЂРЅРѕРіРѕ РіРµРЅРµСЂР°С‚РѕСЂР°
	#if 0
		//#define DIRECT_50M0_X1		1	/* РўР°РєС‚РѕРІС‹Р№ РіРµРЅРµСЂР°С‚РѕСЂ РЅР° РїР»Р°С‚Рµ 50.0 РњР“С† */	
		#define DIRECT_80M0_X1		1	/* РўР°РєС‚РѕРІС‹Р№ РіРµРЅРµСЂР°С‚РѕСЂ РЅР° РїР»Р°С‚Рµ 80.0 РњР“С† */	
		//#define DIRECT_72M595_X1	1	/* РўР°РєС‚РѕРІС‹Р№ РіРµРЅРµСЂР°С‚РѕСЂ 75.595 РњР“С† */	
		#define BANDSELSTYLERE_UPCONV56M_36M	1	/* Up-conversion with working band .030..36 MHz */
	#elif 0
		#define DIRECT_100M0_X1		1	/* РўР°РєС‚РѕРІС‹Р№ РіРµРЅРµСЂР°С‚РѕСЂ РЅР° РїР»Р°С‚Рµ 100.0 РњР“С† */	
		#define BANDSELSTYLERE_UPCONV56M_45M	1	/* Up-conversion with working band .030..45 MHz */
	#else
		//#define DIRECT_125M0_X1		1	/* РўР°РєС‚РѕРІС‹Р№ РіРµРЅРµСЂР°С‚РѕСЂ РЅР° РїР»Р°С‚Рµ 125.0 РњР“С† */	
		#define DIRECT_122M88_X1	1	/* РўР°РєС‚РѕРІС‹Р№ РіРµРЅРµСЂР°С‚РѕСЂ 122.880 РњР“С† */	
		#define BANDSELSTYLERE_UPCONV56M	1	/* Up-conversion with working band .030..56 MHz */
	#endif
	#define FQMODEL_FPGA		1	// FPGA + IQ over I2S

	// --- РІР°СЂРёР°С†РёРё РїСЂРѕС€РёРІРєРё, СЃРїРµС†РёС„РёС‡РµСЃРєРёРµ РґР»СЏ СЂР°Р·РЅС‹С… С‡Р°СЃС‚РѕС‚

	#define CTLREGMODE_STORCH_V6	1	/* TFT 4.3" "Р’РѕСЂРѕРЅС‘РЅРѕРє" СЃ DSP Рё FPGA, SD-CARD, dual watch - mini RX */

