ua1arn/hftrx/boards/arm_stm32f4xx_tqfp176_ctlstyle_storch_v6_UA1M.h
	//#define CODEC_TYPE_WM8731_USE_SPI	1
	//#define CODEC_TYPE_WM8731_USE_8KS	1	/* РєРѕРґРµРє СЂР°Р±РѕС‚Р°РµС‚ СЃ sample rate 8 kHz */

	#define CODEC1_TYPE CODEC_TYPE_NAU8822L
	#define CODEC_TYPE_NAU8822_USE_SPI	1
	//#define CODEC_TYPE_NAU8822_USE_8KS	1	/* РєРѕРґРµРє СЂР°Р±РѕС‚Р°РµС‚ СЃ sample rate 8 kHz */

	//#define WITHDTMFPROCESSING 1
	//#define WITHBBOXMIKESRC BOARD_TXAUDIO_LINE

	#define CODEC2_TYPE	CODEC_TYPE_FPGAV1	/* РєРІР°РґСЂР°С‚СѓСЂС‹ РїРѕР»СѓС‡Р°РµРј РѕС‚ FPGA */
	//#define CODEC_TYPE_CS4272_USE_SPI	1		// codecboard v2.0
	//#define CODEC_TYPE_CS4272_STANDALONE	1		// codecboard v3.0

	#define WITHSAI1_FRAMEBITS 256	// РџРѕР»РЅС‹Р№ СЂР°Р·РјРµСЂ С„СЂРµР№РјР°
	//#define WITHSAI2_FRAMEBITS 64	// РџРѕР»РЅС‹Р№ СЂР°Р·РјРµСЂ С„СЂРµР№РјР° РґР»СЏ РґРІСѓС… РєРІР°РґСЂР°С‚СѓСЂ РїРѕ 24 Р±РёС‚Р° - РєР°РЅР°Р» СЃРїРµРєС‚СЂРѕР°РЅР°Р»РёР·Р°С‚РѕСЂР°
	#define WITHSAI1_FORMATI2S_PHILIPS 1	// С‚СЂРµР±СѓРµС‚СЃСЏ РїСЂРё РїРѕР»СѓС‡РµРЅРёРё РґР°РЅРЅС‹С… РѕС‚ FPGA
	//#define WITHSAI2_FORMATI2S_PHILIPS 1	// С‚СЂРµР±СѓРµС‚СЃСЏ РїСЂРё РїРѕР»СѓС‡РµРЅРёРё РґР°РЅРЅС‹С… РѕС‚ FPGA
	#define WITHI2S_FORMATI2S_PHILIPS 1	// Р’РѕР·РјРѕР¶РЅРѕ РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРµ РїСЂРё РїРµСЂРµРґР°С‡Рµ РґР°РЅРЅС‹С… РІ РєРѕРґРµРє, РїРѕРґРєР»СЋС‡РµРЅРЅС‹Р№ Рє РЅР°СѓС€РЅРёРєР°Рј Рё РјРёРєСЂРѕС„РѕРЅСѓ
	#define WITHI2SHWRXSLAVE	1		// РџСЂРёС‘РјРЅС‹Р№ РєР°РЅР°Р» I2S (РјРёРєСЂРѕС„РѕРЅ) РёСЃРїРѕР»СЊР·СѓСЋСЃСЏ РІ SLAVE MODE
	#define WITHI2SHWTXSLAVE	1		// РџРµСЂРµРґР°СЋС‰РёР№ РєР°РЅР°Р» I2S (РЅР°СѓС€РЅРёРєРё) РёСЃРїРѕР»СЊР·СѓСЋСЃСЏ РІ SLAVE MODE
	//#define WITHSAI1HWTXRXMASTER	1		// SAI1 work in MASTER mode
	#define WITHNESTEDINTERRUPTS	1	/* РёСЃРїРѕР»СЊР·СѓРµС‚СЃСЏ РїСЂРё РЅР°Р»РёС‡РёРё real-time С‡Р°СЃС‚Рё. */
	#define WITHINTEGRATEDDSP		1	/* РІ РїСЂРѕРіСЂР°РјРјСѓ РІРєР»СЋС‡РµРЅР° РёРЅРёС†РёР°Р»РёР·Р°С†РёСЏ Рё Р·Р°РїСѓСЃРє DSP С‡Р°СЃС‚Рё. */
	#define WITHIFDACWIDTH	32		// 1 Р±РёС‚ Р·РЅР°Рє Рё 31 Р±РёС‚ Р·РЅР°С‡Р°С‰РёС…
	#define WITHIFADCWIDTH	32		// 1 Р±РёС‚ Р·РЅР°Рє Рё 31 Р±РёС‚ Р·РЅР°С‡Р°С‰РёС…
	#define WITHAFADCWIDTH	16		// 1 Р±РёС‚ Р·РЅР°Рє Рё 15 Р±РёС‚ Р·РЅР°С‡Р°С‰РёС…
	#define WITHAFDACWIDTH	16		// 1 Р±РёС‚ Р·РЅР°Рє Рё 15 Р±РёС‚ Р·РЅР°С‡Р°С‰РёС…
	//#define WITHDACOUTDSPAGC		1	/* РђР РЈ СЂРµР°Р»РёР·РѕРІР°РЅРѕ РєР°Рє РІС‹С…РѕРґ Р¦РђРџ РЅР° Р°РЅР°Р»РѕРіРѕРІСѓСЋ С‡Р°СЃС‚СЊ. */
	//#define WITHEXTERNALDDSP		1	/* РёРјРµРµС‚СЃСЏ СѓРїСЂР°РІР»РµРЅРёРµ РІРЅРµС€РЅРµР№ DSP РїР»Р°С‚РѕР№. */
	#define WITHDSPEXTDDC 1			/* РљРІР°РґСЂР°С‚СѓСЂС‹ РїРѕР»СѓС‡Р°СЋС‚СЃСЏ РІРЅРµС€РЅРµР№ Р°РїРїР°СЂР°С‚СѓСЂРѕР№ */
	#define WITHDSPEXTFIR 1			/* Р¤РёР»СЊС‚СЂР°С†РёСЏ РєРІР°РґСЂР°С‚СѓСЂ РѕСЃСѓС‰РµСЃС‚РІР»СЏРµС‚СЃСЏ РІРЅРµС€РЅРµР№ Р°РїРїР°СЂР°С‚СѓСЂРѕР№ */
	//#define WITHDSPLOCALFIR 1		/* test: Р¤РёР»СЊС‚СЂР°С†РёСЏ РєРІР°РґСЂР°С‚СѓСЂ РѕСЃСѓС‰РµСЃС‚РІР»СЏРµС‚СЃСЏ РїСЂРѕС†РµСЃСЃРѕСЂРѕРј */
	#define WITHIF4DSP	1			/*  "Р”СЏС‚РµР»" */
	#define WITHDACSTRAIGHT 1		/* РўСЂРµР±СѓРµС‚СЃСЏ С„РѕСЂРјРёСЂРѕРІР°РЅРёРµ РєРѕРґР° РґР»СЏ Р¦РђРџ РІ СЂРµР¶РёРјРµ Р±РµР·Р·РЅР°РєРѕРІРѕРіРѕ РєРѕРґР° */

	// FPGA section
	//#define	WITHFPGAWAIT_AS	1	/* FPGA Р·Р°РіСЂСѓР¶Р°РµС‚СЃСЏ РёР· СЃРѕР±СЃС‚РІРµРЅРЅРѕР№ РјРёРєСЂРѕСЃС…РµРјС‹ Р·Р°РіСЂСѓР·С‡РёРєР° - РґРѕР¶РґР°С‚СЊСЃСЏ РѕРєРѕРЅС‡Р°РЅРёСЏ Р·Р°РіСЂСѓР·РєРё РїРµСЂРµРґ РёРЅРёС†РёР°Р»РёР·Р°С†РёРµР№ SPI РІ РїСЂРѕС†РµСЃСЃРѕСЂРµ */
	#define	WITHFPGALOAD_PS	1	/* FPGA Р·Р°РіСЂСѓР¶Р°РµС‚СЃСЏ РїСЂРѕС†РµСЃСЃРѕСЂРѕРј СЃ РїРѕРјРѕС‰СЊСЋ SPI */

	#define WITHUSEDUALWATCH	1	// Р’С‚РѕСЂРѕР№ РїСЂРёРµРјРЅРёРє
	//#define WITHLOOPBACKTEST	1	/* РїСЂРѕСЃР»СѓС€РёРІР°РЅРёРµ РјРёРєСЂРѕС„РѕРЅРЅРѕРіРѕ РІС…РѕРґР°, РіРµРЅРµСЂР°С‚РѕСЂРѕРІ */
	//#define WITHMODEMIQLOOPBACK	1	/* РјРѕРґРµРј РїРѕР»СѓС‡Р°РµС‚ СЃРѕР±СЃС‚РІРµРЅРЅС‹Рµ РїРµСЂРµРґР°РІР°РµРјС‹Рµ РєРІР°РґСЂР°С‚СѓСЂС‹ */

	//#define WITHUSESDCARD		1	// Р’РєР»СЋС‡РµРЅРёРµ РїРѕРґРґРµСЂР¶РєРё SD CARD
	//#define WITHUSEUSBFLASH		1	// Р’РєР»СЋС‡РµРЅРёРµ РїРѕРґРґРµСЂР¶РєРё USB memory stick
	//#define WITHUSEAUDIOREC		1	// Р—Р°РїРёСЃСЊ Р·РІСѓРєР° РЅР° SD CARD
	//#define WITHUSEAUDIOREC2CH	1	// Р—Р°РїРёСЃСЊ Р·РІСѓРєР° РЅР° SD CARD РІ СЃС‚РµСЂРµРѕ
	//#define WITHUSEAUDIORECCLASSIC	1	// СЃС‚Р°РЅРґР°СЂС‚РЅС‹Р№ С„РѕСЂРјР°С‚ Р·Р°РїРёСЃРё, Р±РµР· "РґС‹СЂ"

	#define WITHRTS96 1		/* РІРјРµСЃС‚Рѕ РІС‹С…РѕРґРЅРѕРіРѕ Р°СѓРґРёРѕСЃРёРіРЅР°Р»Р° РїРµСЂРµРґР°С‡Р° РєРІР°РґСЂР°С‚СѓСЂ РїРѕ USB */
	//#define WITHFQMETER	1	/* РµСЃС‚СЊ СЃС…РµРјР° РёР·РјРµСЂРµРЅРёСЏ РѕРїРѕСЂРЅРѕР№ С‡Р°СЃС‚РѕС‚С‹, РїРѕ РІРЅРµС€РЅРµРјСѓ PPS */
	//#define WITHOPERA4BEACON	1	/* СЂР°Р±РѕС‚Р° РјР°СЏРєРѕРј РІ OPERA */

	#if 0
		#define WITHUSBHEADSET 1	/* С‚СЂР°РЅСЃРёРІРµСЂ СЂР°Р±РѕС‚Р°РµС‚ USB РіР°СЂРЅРёС‚СѓСЂРѕР№ РґР»СЏ РєРѕРјРїСЋС‚РµСЂР° - СЂРµР¶РёРј С‚РµСЃС‚РёСЂРѕРІР°РЅРёСЏ */
		#define WITHBBOX	1	// Black Box mode - СѓСЃС‚СЂРѕР№СЃС‚РІРѕ Р±РµР· РѕСЂРіР°РЅРѕРІ СѓРїСЂР°РІР»РµРЅРёСЏ
		#define	WITHBBOXMIKESRC	BOARD_TXAUDIO_USB
	#elif 0
		#define WITHBBOX	1	// Black Box mode - СѓСЃС‚СЂРѕР№СЃС‚РІРѕ Р±РµР· РѕСЂРіР°РЅРѕРІ СѓРїСЂР°РІР»РµРЅРёСЏ
		#define	WITHBBOXFREQ	26985000L		// С‡Р°СЃС‚РѕС‚Р° РїРѕСЃР»Рµ РІРєР»СЋС‡РµРЅРёСЏ
		//#define	WITHBBOXFREQ	(26985000L - 260)		// С‡Р°СЃС‚РѕС‚Р° РїРѕСЃР»Рµ РІРєР»СЋС‡РµРЅРёСЏ - 135 РєРѕСЂСЂРµРєС†РёСЏ С‡Р°СЃС‚РѕС‚С‹ РїР»Р°С‚С‹ СЃ  122.88 РґР»СЏ РїРѕРїР°РґР°РЅРёСЏ РІ РїСЂРёС‘Рј РїР»Р°С‚С‹ СЃ 100 РњР“С† РіРµРЅРµСЂР°С‚РѕСЂРѕРј Р±РµР· РєРѕСЂСЂРµРєС†РёРё
		//#define	WITHBBOXFREQ	(26985000L - 1600)		// С‡Р°СЃС‚РѕС‚Р° РїРѕСЃР»Рµ РІРєР»СЋС‡РµРЅРёСЏ
		//#define	WITHBBOXFREQ	(14070000L - 1000)		// РїСЂРѕСЃР»СѓС€РёРІР°РЅРёРµ BPSK С‡Р°СЃС‚РѕС‚
		//#define	WITHBBOXFREQ	(14065000L - 135)		// С‡Р°СЃС‚РѕС‚Р° РїРѕСЃР»Рµ РІРєР»СЋС‡РµРЅРёСЏ - 135 РєРѕСЂСЂРµРєС†РёСЏ С‡Р°СЃС‚РѕС‚С‹ РїР»Р°С‚С‹ СЃ  122.88 РґР»СЏ РїРѕРїР°РґР°РЅРёСЏ РІ РїСЂРёС‘Рј РїР»Р°С‚С‹ СЃ 100 РњР“С† РіРµРЅРµСЂР°С‚РѕСЂРѕРј Р±РµР· РєРѕСЂСЂРµРєС†РёРё
		//#define	WITHBBOXFREQ	14065000L		// С‡Р°СЃС‚РѕС‚Р° РїРѕСЃР»Рµ РІРєР»СЋС‡РµРЅРёСЏ
		//#define	WITHBBOXFREQ	(14065000L - 1000)		// С‡Р°СЃС‚РѕС‚Р° РїРѕСЃР»Рµ РІРєР»СЋС‡РµРЅРёСЏ
		//#define	WITHBBOXSUBMODE	SUBMODE_USB	// РµРґРёРЅСЃС‚РІРµРЅРЅС‹Р№ СЂРµР¶РёРј СЂР°Р±РѕС‚С‹
		#define	WITHBBOXSUBMODE	SUBMODE_BPSK	// РµРґРёРЅСЃС‚РІРµРЅРЅС‹Р№ СЂРµР¶РёРј СЂР°Р±РѕС‚С‹
		//#define	WITHBBOXFREQ	27100000L		// С‡Р°СЃС‚РѕС‚Р° РїРѕСЃР»Рµ РІРєР»СЋС‡РµРЅРёСЏ
		//#define	WITHBBOXSUBMODE	SUBMODE_CW	// РµРґРёРЅСЃС‚РІРµРЅРЅС‹Р№ СЂРµР¶РёРј СЂР°Р±РѕС‚С‹
		//#define	WITHBBOXTX		1		// Р°РІС‚РѕРјР°С‚РёС‡РµСЃРєРёР№ РїРµСЂРµС…РѕРґ РЅР° РїРµСЂРµРґР°С‡Сѓ
		//#define	WITHBBOXMIKESRC	BOARD_TXAUDIO_2TONE
	#elif 0
		#define WITHBBOX	1	// Black Box mode - СѓСЃС‚СЂРѕР№СЃС‚РІРѕ Р±РµР· РѕСЂРіР°РЅРѕРІ СѓРїСЂР°РІР»РµРЅРёСЏ
		#define	WITHBBOXFREQ	136000L		// С‡Р°СЃС‚РѕС‚Р° РїРѕСЃР»Рµ РІРєР»СЋС‡РµРЅРёСЏ
		#define	WITHBBOXSUBMODE	SUBMODE_USB	// РµРґРёРЅСЃС‚РІРµРЅРЅС‹Р№ СЂРµР¶РёРј СЂР°Р±РѕС‚С‹
		#define WITHBBOXREC	1		// Р°РІС‚РѕРјР°С‚РёС‡РµСЃРєРѕРµ РІРєР»СЋС‡РµРЅРёРµ СЂРµР¶РёРјР° Р·Р°РїРёСЃРё РїРѕСЃР»Рµ РїРѕРґР°С‡Рё РїРёС‚Р°РЅРёСЏ
	#elif 0
		#define WITHBBOX	1	// Black Box mode - СѓСЃС‚СЂРѕР№СЃС‚РІРѕ Р±РµР· РѕСЂРіР°РЅРѕРІ СѓРїСЂР°РІР»РµРЅРёСЏ
		#define	WITHBBOXFREQ	7030000L		// С‡Р°СЃС‚РѕС‚Р° РїРѕСЃР»Рµ РІРєР»СЋС‡РµРЅРёСЏ
		#define	WITHBBOXSUBMODE	SUBMODE_LSB	// РµРґРёРЅСЃС‚РІРµРЅРЅС‹Р№ СЂРµР¶РёРј СЂР°Р±РѕС‚С‹
		#define	WITHBBOXTX		1		// Р°РІС‚РѕРјР°С‚РёС‡РµСЃРєРёР№ РїРµСЂРµС…РѕРґ РЅР° РїРµСЂРµРґР°С‡Сѓ
		#define	WITHBBOXMIKESRC	BOARD_TXAUDIO_2TONE
	#elif 0
		#define WITHBBOX	1	// Black Box mode - СѓСЃС‚СЂРѕР№СЃС‚РІРѕ Р±РµР· РѕСЂРіР°РЅРѕРІ СѓРїСЂР°РІР»РµРЅРёСЏ
		#define	WITHBBOXFREQ	7030000L		// С‡Р°СЃС‚РѕС‚Р° РїРѕСЃР»Рµ РІРєР»СЋС‡РµРЅРёСЏ
		#define	WITHBBOXSUBMODE	SUBMODE_CWZ	// РµРґРёРЅСЃС‚РІРµРЅРЅС‹Р№ СЂРµР¶РёРј СЂР°Р±РѕС‚С‹
		#define	WITHBBOXTX		1		// Р°РІС‚РѕРјР°С‚РёС‡РµСЃРєРёР№ РїРµСЂРµС…РѕРґ РЅР° РїРµСЂРµРґР°С‡Сѓ
		//#define	WITHBBOXMIKESRC BOARD_TXAUDIO_2TONE
	#endif


	// +++ Р­С‚Рё СЃС‚СЂРѕРєРё РјРѕР¶РЅРѕ РѕС‚РєР»СЋС‡Р°С‚СЊ, СѓРјРµРЅСЊС€Р°СЏ С„СѓРЅРєС†РёРѕРЅР°Р»СЊРЅРѕСЃС‚СЊ РіРѕС‚РѕРІРѕРіРѕ РёР·РґРµР»РёСЏ
	//#define WITHRFSG	1	/* РІРєР»СЋС‡РµРЅРѕ СѓРїСЂР°РІР»РµРЅРёРµ Р’Р§ СЃРёРіРЅР°Р»-РіРµРЅРµСЂР°С‚РѕСЂРѕРј. */
	#define WITHTX		1	/* РІРєР»СЋС‡РµРЅРѕ СѓРїСЂР°РІР»РµРЅРёРµ РїРµСЂРµРґР°С‚С‡РёРєРѕРј - СЃРёРєРІРµРЅСЃРѕСЂ, СЌР»РµРєС‚СЂРѕРЅРЅС‹Р№ РєР»СЋС‡. */
	#if 1
		/* TUNER & PA board 2*RD16 by avbelnn@yandex.ru */
		//#define WITHAUTOTUNER	1	/* Р•СЃС‚СЊ С„СѓРЅРєС†РёСЏ Р°РІС‚РѕС‚СЋРЅРµСЂР° */
		//#define SHORTSET8	1	
		//#define WITHVOLTLEVEL	1	/* РѕС‚РѕР±СЂР°Р¶РµРЅРёРµ РЅР°РїСЂСЏР¶РµРЅРёСЏ РђРљР‘ */
		//#define WITHCURRLEVEL	1	/* РѕС‚РѕР±СЂР°Р¶РµРЅРёРµ С‚РѕРєР° РѕРєРѕРЅРµС‡РЅРѕРіРѕ РєР°СЃРєР°РґР° */
		//#define WITHTHERMOLEVEL	1	/* РѕС‚РѕР±СЂР°Р¶РµРЅРёРµ С‚РµРјРїРµСЂР°С‚СѓСЂС‹ */

		//#define WITHENCODER2	1		/* РµСЃС‚СЊ РІС‚РѕСЂРѕР№ РІР°Р»РєРѕРґРµСЂ */
		//#define BOARD_ENCODER2_DIVIDE 4		/* Р·РЅР°С‡РµРЅРёРµ РґР»СЏ РІР°Р»РєРѕРґРµСЂР° PEC16-4220F-n0024 (СЃ С‚СЂРµС‰С‘С‚РєРѕР№") */
	#endif
	#define WITHIFSHIFT	1	/* РёСЃРїРѕР»СЊР·СѓРµС‚СЃСЏ IF SHIFT */
	//#define WITHIFSHIFTOFFSET	(-250)	/* РќР°С‡Р°Р»СЊРЅРѕРµ Р·Р°РЅС‡РµРЅРёРµ IF SHIFT */
	//#define WITHPBT		1	/* РёСЃРїРѕР»СЊР·СѓРµС‚СЃСЏ PBT (РµСЃР»Рё LO3 РµСЃС‚СЊ) */
	#define WITHCAT		1	/* РёСЃРїРѕР»СЊР·СѓРµС‚СЃСЏ CAT */
	//#define WITHDEBUG		1	/* РћС‚Р»Р°РґРѕС‡РЅР°СЏ РїРµС‡Р°С‚СЊ С‡РµСЂРµР· COM-РїРѕСЂС‚. Р‘РµР· CAT (WITHCAT) */
	//#define WITHMODEM		1	/* РЈСЃС‚СЂРѕР№СЃС‚РІРѕ СЂР°Р±РѕС‚Р°РµС‚ РєР°Рє СЂР°РґРёРѕРјРѕРґРµРј СЃ РїРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅС‹Рј РёРЅС‚РµСЂС„РµР№СЃРѕРј */
	//#define WITHFREEDV	1	/* РїРѕРґРґРµСЂР¶РєР° СЂРµР¶РёРјР° FreeDV - http://freedv.org/ */ 
	//#define WITHNMEA		1	/* РёСЃРїРѕР»СЊР·СѓРµС‚СЃСЏ NMEA parser */
	//#define WITHBEACON	1	/* РСЃРїРѕР»СЊР·СѓРµС‚СЃСЏ СЂРµР¶РёРј РјР°СЏРєР° */
	#define WITHVOX			1	/* РёСЃРїРѕР»СЊР·СѓРµС‚СЃСЏ VOX */
	#define WITHSHOWSWRPWR 1	/* РЅР° РґРёСЃРїР»РµРµ РѕРґРЅРѕРІСЂРµРјРµРЅРЅРѕ РѕС‚РѕР±СЂР°Р¶Р°СЋС‚СЃСЏ SWR-meter Рё PWR-meter */
	#define WITHSWRMTR	1		/* РР·РјРµСЂРёС‚РµР»СЊ РљРЎР’ */
	//#define WITHPWRMTR	1	/* РРЅРґРёРєР°С‚РѕСЂ РІС‹С…РѕРґРЅРѕР№ РјРѕС‰РЅРѕСЃС‚Рё РёР»Рё */
	//#define WITHPWRLIN	1	/* РРЅРґРёРєР°С‚РѕСЂ РІС‹С…РѕРґРЅРѕР№ РјРѕС‰РЅРѕСЃС‚Рё РїРѕРєР°Р·С‹РІР°РµС‚ РЅР°РїСЂСЏР¶РµРЅРёРµ Р° РЅРµ РјРѕС‰РЅРѕСЃС‚СЊ */
	#define WITHBARS		1	/* РѕС‚РѕР±СЂР°Р¶РµРЅРёРµ S-РјРµС‚СЂР° Рё SWR-РјРµС‚СЂР° */
	//#define WITHSWLMODE	1	/* РїРѕРґРґРµСЂР¶РєР° Р·Р°РїРѕРјРёРЅР°РЅРёСЏ РјРЅРѕР¶РµСЃС‚РІР° С‡Р°СЃС‚РѕС‚ РІ swl-mode */
	#define WITHVIBROPLEX	1	/* РІРѕР·РјРѕР¶РЅРѕСЃС‚СЊ СЌРјСѓР»СЏС†РёРё РїРµСЂРµРґР°С‡Рё РІРёР±СЂРѕРїР»РµРєСЃРѕРј */
	#define WITHSPKMUTE		1	/* СѓРїСЂР°РІР»РµРЅРёРµ РІС‹РєР»СЋС‡РµРЅРёРµРј РґРёРЅР°РјРёРєР° */
	#define WITHDATAMODE	1	/* СѓРїСЂР°РІР»РµРЅРёРµ СЃ РєР»Р°РІРёР°С‚СѓСЂС‹ РїРµСЂРµРґР°С‡РµР№ СЃ USB AUDIO РєР°РЅР°Р»Р° */
	// Р•СЃС‚СЊ Р»Рё СЂРµРіСѓР»РёСЂРѕРІРєР° РїР°СЂР°РјРµС‚СЂРѕРІ РїРѕС‚РµРЅС†РёРѕРјРµС‚СЂР°РјРё
	////#define WITHPOTWPM		1	/* РёСЃРїРѕР»СЊР·СѓРµС‚СЃСЏ СЂРµРіСѓР»РёСЂРѕРІРєР° СЃРєРѕСЂРѕСЃС‚Рё РїРµСЂРµРґР°С‡Рё РІ С‚РµР»РµРіСЂР°С„Рµ РїРѕС‚РµРЅС†РёРѕРјРµС‚СЂРѕРј */
	#define WITHPOTIFGAIN		1	/* СЂРµРіСѓР»СЏС‚РѕСЂС‹ СѓСЃРёР»РµРЅРёСЏ РџР§ РЅР° РїРѕС‚РµРЅС†РёРѕРјРµС‚СЂР°С… */
	#define WITHPOTAFGAIN		1	/* СЂРµРіСѓР»СЏС‚РѕСЂС‹ СѓСЃРёР»РµРЅРёСЏ РќР§ РЅР° РїРѕС‚РµРЅС†РёРѕРјРµС‚СЂР°С… */
	//#define WITHPOTPOWER	1	/* СЂРµРіСѓР»СЏС‚РѕСЂ РјРѕС‰РЅРѕСЃС‚Рё РЅР° РїРѕС‚РµРЅС†РёРѕРјРµС‚СЂРµ */
	//#define WITHANTSELECT	1	// РЈРїСЂР°РІР»РµРЅРёРµ РїРµСЂРµРєР»СЋС‡РµРЅРёРµРј Р°РЅС‚РµРЅРЅ

	#define WITHMENU 	1	/* С„СѓРЅРєС†РёРѕРЅР°Р»СЊРЅРѕСЃС‚СЊ РјРµРЅСЋ РјРѕР¶РµС‚ Р±С‹С‚СЊ РѕС‚РєР»СЋС‡РµРЅР° - РµСЃР»Рё РЅР°СЃС‚СЂР°РёРІР°С‚СЊ РЅРµС‡РµРіРѕ */

	//#define WITHONLYBANDS 1		/* РџРµСЂРµСЃС‚СЂРѕР№РєР° РјРѕР¶РµС‚ Р±С‹С‚СЊ РѕРіСЂР°РЅРёС‡РµРЅР° Р»СЋР±РёС‚РµР»СЊСЃРєРёРјРё РґРёР°РїР°Р·РѕРЅР°РјРё */
	//#define WITHBCBANDS	1		/* РІ С‚Р°Р±Р»РёС†Рµ РґРёР°РїР°Р·РѕРЅРѕРІ РїСЂРёСЃСѓС‚СЃС‚РІСѓСЋС‚ РІРµС‰Р°С‚РµР»СЊРЅС‹Рµ РґРёР°РїР°Р·РѕРЅС‹ */
	#define WITHWARCBANDS	1	/* Р’ С‚Р°Р±Р»РёС†Рµ РґРёР°РїР°Р·РѕРЅРѕРІ РїСЂРёСЃСѓС‚СЃС‚РІСѓСЋС‚ HF WARC РґРёР°РїР°Р·РѕРЅС‹ */
	//#define WITHLO1LEVELADJ		1	/* РІРєР»СЋС‡РµРЅРѕ СѓРїСЂР°РІР»РµРЅРёРµ СѓСЂРѕРІРЅРµРј (Р°РјРїР»РёС‚СѓРґРѕР№) LO1 */
	//#define WITHLFM		1	/* LFM MODE */
	//#define WITHTEMPSENSOR	1	/* РѕС‚РѕР±СЂР°Р¶РµРЅРёРµ РґР°РЅРЅС‹С… СЃ РґР°С‚С‡РёРєР° С‚РµРјРїРµСЂР°С‚СѓСЂС‹ */
	#define WITHREFSENSOR	1		/* РёР·РјРµСЂРµРЅРёРµ РїРѕ РІС‹РґРµР»РµРЅРЅРѕРјСѓ РєР°РЅР°Р»Сѓ РђР¦Рџ РѕРїРѕСЂРЅРѕРіРѕ РЅР°РїСЂСЏР¶РµРЅРёСЏ */
	#define WITHDIRECTBANDS 1	/* РџСЂСЏРјРѕР№ РїРµСЂРµС…РѕРґ Рє РґРёР°РїР°Р·РѕРЅР°Рј РїРѕ РЅР°Р¶Р°С‚РёСЏРј РЅР° РєР»Р°РІРёР°С‚СѓСЂРµ */
	// --- Р­С‚Рё СЃС‚СЂРѕРєРё РјРѕР¶РЅРѕ РѕС‚РєР»СЋС‡Р°С‚СЊ, СѓРјРµРЅСЊС€Р°СЏ С„СѓРЅРєС†РёРѕРЅР°Р»СЊРЅРѕСЃС‚СЊ РіРѕС‚РѕРІРѕРіРѕ РёР·РґРµР»РёСЏ

	//#define LO1PHASES	1		/* РџСЂСЏРјРѕР№ СЃРёРЅС‚РµР· РїРµСЂРІРѕРіРѕ РіРµС‚РµСЂРѕРґРёРЅР° РґРІСѓРјСЏ DDS СЃ РїСЂРѕРіСЂР°РјРёРјСЂСѓРµРјС‹Рј СЃРґРІРёРіРѕРј С„Р°Р·С‹ */
	#define WITHFANTIMER	1	/* РІС‹РєР»СЋС‡Р°СЋС‰РёР№СЃСЏ РїРѕ С‚Р°Р№РјРµСЂСѓ РІРµРЅС‚РёР»СЏС‚РѕСЂ РІ СѓСЃРёР»РёС‚РµР»Рµ РјРѕС‰РЅРѕСЃС‚Рё */
	#define WITHSLEEPTIMER	1	/* РІС‹РєР»СЋС‡РёС‚СЊ РёРЅРґРёРєР°С‚РѕСЂ Рё РІС‹РІРѕРґ Р·РІСѓРєР° РїРѕ РёСЃС‚РµС‡РµРЅРёРёРё СѓРєР°Р·Р°РЅРЅРѕРіРѕ РІСЂРµРјРµРЅРё */

